/*1
Опис:
Створити PL-SQL блок, який в залежності від року показує, це високосний рік чи ні.

Деталі:
Будь-який рік, який ділиться на 4 без залишку, є високосним роком. Наприклад: 2012, 2016 та 2020 роки є високосними роками. 

Заведіть дві змінні v_year та v_check_year типу даних number. Змінній v_year відразу присвойте якийсь рік (наприклад 2012). Далі в середині блоку, змінній v_check_year присвойте значення по формулі - mod(v_year, 4). Далі по коду, зробіть розгалуження через оператора IF, і якщо змінна v_check_year=0, то виведіть текст "Високосний рік", а інакше "Не високосний рік". Перевірте як працює ваш PL-SQL блок з іншими значеннями в змінній v_year.

Зберегти PL-SQL блок у файл під назвою H_01_01_tvoji_inichialy.sql. Загрузити в LMS Moodle.*/



SET SERVEROUTPUT ON

DECLARE
v_year number;
v_check_year number;

BEGIN
v_year:=2012;
v_check_year:=  mod(v_year, 4);

IF v_check_year = 0  THEN
dbms_output.put_line(v_year || ' - Vis ?????????? ???');
ELSE
dbms_output.put_line(v_year || ' - Ne vis ?? ?????????? ???');
END IF;
END;
/